garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F16Q41.PIC
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="U3RXB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U3RXB" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2C7">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="U3RXBL"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB" edc:desc="" edc:mask="0xff" edc:name="RXB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x2C8"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U3TXB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U3TXB" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2C9">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="U3TXBL"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB" edc:desc="" edc:mask="0xff" edc:name="TXB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x2CA"/>
        <edc:JoinedSFRDef edc:cname="U3P1" edc:desc="" edc:name="U3P1" edc:nzwidth="0x10" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2CB">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U3P1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U3P1L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2CB">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="P1L" edc:desc="" edc:mask="0xff" edc:name="P1L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:AdjustPoint edc:offset="1" edc:_addr="0x2CC"/>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="U3P2" edc:desc="" edc:name="U3P2" edc:nzwidth="0x10" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2CD">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U3P2L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U3P2L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2CD">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="P2L" edc:desc="" edc:mask="0xff" edc:name="P2L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:AdjustPoint edc:offset="1" edc:_addr="0x2CE"/>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="U3P3" edc:desc="" edc:name="U3P3" edc:nzwidth="0x10" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2CF">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U3P3L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="U3P3L" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2CF">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="P3L" edc:desc="" edc:mask="0xff" edc:name="P3L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:AdjustPoint edc:offset="1" edc:_addr="0x2D0"/>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="U3CON0" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="U3CON0" edc:nzwidth="8" edc:por="0000-000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2D1">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U3MODE" edc:desc="" edc:mask="0x7" edc:name="U3MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="U3RXEN" edc:desc="" edc:mask="0x1" edc:name="U3RXEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3TXEN" edc:desc="" edc:mask="0x1" edc:name="U3TXEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3ABDEN" edc:desc="" edc:mask="0x1" edc:name="U3ABDEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3BRGS" edc:desc="" edc:mask="0x1" edc:name="U3BRGS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="U3MODE0" edc:desc="" edc:mask="0x1" edc:name="U3MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3MODE1" edc:desc="" edc:mask="0x1" edc:name="U3MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3MODE2" edc:desc="" edc:mask="0x1" edc:name="U3MODE2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x7" edc:name="MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="RXEN" edc:desc="" edc:mask="0x1" edc:name="RXEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXEN" edc:desc="" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ABDEN" edc:desc="" edc:mask="0x1" edc:name="ABDEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BRGS" edc:desc="" edc:mask="0x1" edc:name="BRGS" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n--nn-nn" edc:cname="U3CON1" edc:desc="" edc:impl="0x9b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0--00-00" edc:name="U3CON1" edc:nzwidth="8" edc:por="0--00-00" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2D2">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SENDB" edc:desc="" edc:mask="0x1" edc:name="SENDB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BRKOVR" edc:desc="" edc:mask="0x1" edc:name="BRKOVR" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RXBIMD" edc:desc="" edc:mask="0x1" edc:name="RXBIMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WUE" edc:desc="" edc:mask="0x1" edc:name="WUE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U3SENDB" edc:desc="" edc:mask="0x1" edc:name="U3SENDB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3BRKOVR" edc:desc="" edc:mask="0x1" edc:name="U3BRKOVR" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U3RXBIMD" edc:desc="" edc:mask="0x1" edc:name="U3RXBIMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3WUE" edc:desc="" edc:mask="0x1" edc:name="U3WUE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U3ON" edc:desc="" edc:mask="0x1" edc:name="U3ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="U3CON2" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="U3CON2" edc:nzwidth="8" edc:por="0000-000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2D3">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FLO" edc:desc="" edc:mask="0x3" edc:name="FLO" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TXPOL" edc:desc="" edc:mask="0x1" edc:name="TXPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="STP" edc:desc="" edc:mask="0x3" edc:name="STP" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="RXPOL" edc:desc="" edc:mask="0x1" edc:name="RXPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RUNOVF" edc:desc="" edc:mask="0x1" edc:name="RUNOVF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FLO0" edc:desc="" edc:mask="0x1" edc:name="FLO0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLO1" edc:desc="" edc:mask="0x1" edc:name="FLO1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="STP0" edc:desc="" edc:mask="0x1" edc:name="STP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STP1" edc:desc="" edc:mask="0x1" edc:name="STP1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="U3FLO" edc:desc="" edc:mask="0x3" edc:name="U3FLO" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="U3TXPOL" edc:desc="" edc:mask="0x1" edc:name="U3TXPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U3STP" edc:desc="" edc:mask="0x3" edc:name="U3STP" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="U3RXPOL" edc:desc="" edc:mask="0x1" edc:name="U3RXPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3RUNOVF" edc:desc="" edc:mask="0x1" edc:name="U3RUNOVF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="U3FLO0" edc:desc="" edc:mask="0x1" edc:name="U3FLO0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3FLO1" edc:desc="" edc:mask="0x1" edc:name="U3FLO1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U3STP0" edc:desc="" edc:mask="0x1" edc:name="U3STP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3STP1" edc:desc="" edc:mask="0x1" edc:name="U3STP1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="U3BRG" edc:desc="" edc:name="U3BRG" edc:nzwidth="0x10" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2D4">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U3BRGL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U3BRGL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2D4">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="BRGL" edc:desc="" edc:mask="0xff" edc:name="BRGL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U3BRGH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U3BRGH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2D5">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="BRGH" edc:desc="" edc:mask="0xff" edc:name="BRGH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnrrrrr" edc:cname="U3FIFO" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00101110" edc:name="U3FIFO" edc:nzwidth="8" edc:por="00101110" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2D6">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXBF" edc:desc="" edc:mask="0x1" edc:name="RXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXBE" edc:desc="" edc:mask="0x1" edc:name="RXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="XON" edc:desc="" edc:mask="0x1" edc:name="XON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXIDL" edc:desc="" edc:mask="0x1" edc:name="RXIDL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXBF" edc:desc="" edc:mask="0x1" edc:name="TXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXBE" edc:desc="" edc:mask="0x1" edc:name="TXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STPMD" edc:desc="" edc:mask="0x1" edc:name="STPMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXWRE" edc:desc="" edc:mask="0x1" edc:name="TXWRE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U3RXBF" edc:desc="" edc:mask="0x1" edc:name="U3RXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3RXBE" edc:desc="" edc:mask="0x1" edc:name="U3RXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3XON" edc:desc="" edc:mask="0x1" edc:name="U3XON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3RXIDL" edc:desc="" edc:mask="0x1" edc:name="U3RXIDL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3TXBF" edc:desc="" edc:mask="0x1" edc:name="U3TXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3TXBE" edc:desc="" edc:mask="0x1" edc:name="U3TXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3STPMD" edc:desc="" edc:mask="0x1" edc:name="U3STPMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3TXWRE" edc:desc="" edc:mask="0x1" edc:name="U3TXWRE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="U3RCIDL" edc:mask="0x1" edc:name="U3RCIDL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="RCIDL" edc:mask="0x1" edc:name="RCIDL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn---n--" edc:cname="U3UIR" edc:desc="" edc:impl="0xc4" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00---0--" edc:name="U3UIR" edc:nzwidth="8" edc:por="00---0--" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2D7">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ABDIE" edc:desc="" edc:mask="0x1" edc:name="ABDIE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="ABDIF" edc:desc="" edc:mask="0x1" edc:name="ABDIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WUIF" edc:desc="" edc:mask="0x1" edc:name="WUIF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U3ABDIE" edc:desc="" edc:mask="0x1" edc:name="U3ABDIE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="U3ABDIF" edc:desc="" edc:mask="0x1" edc:name="U3ABDIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3WUIF" edc:desc="" edc:mask="0x1" edc:name="U3WUIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U3ERRIR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="U3ERRIR" edc:nzwidth="8" edc:por="10000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2D8">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXCIF" edc:desc="" edc:mask="0x1" edc:name="TXCIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXFOIF" edc:desc="" edc:mask="0x1" edc:name="RXFOIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXBKIF" edc:desc="" edc:mask="0x1" edc:name="RXBKIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FERIF" edc:desc="" edc:mask="0x1" edc:name="FERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CERIF" edc:desc="" edc:mask="0x1" edc:name="CERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ABDOVF" edc:desc="" edc:mask="0x1" edc:name="ABDOVF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PERIF" edc:desc="" edc:mask="0x1" edc:name="PERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXMTIF" edc:desc="" edc:mask="0x1" edc:name="TXMTIF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U3TXCIF" edc:desc="" edc:mask="0x1" edc:name="U3TXCIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3RXFOIF" edc:desc="" edc:mask="0x1" edc:name="U3RXFOIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3RXBKIF" edc:desc="" edc:mask="0x1" edc:name="U3RXBKIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3FERIF" edc:desc="" edc:mask="0x1" edc:name="U3FERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3CERIF" edc:desc="" edc:mask="0x1" edc:name="U3CERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3ABDOVF" edc:desc="" edc:mask="0x1" edc:name="U3ABDOVF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3PERIF" edc:desc="" edc:mask="0x1" edc:name="U3PERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3TXMTIF" edc:desc="" edc:mask="0x1" edc:name="U3TXMTIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U3ERRIE" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U3ERRIE" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x2D9">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXCIE" edc:desc="" edc:mask="0x1" edc:name="TXCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXFOIE" edc:desc="" edc:mask="0x1" edc:name="RXFOIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXBKIE" edc:desc="" edc:mask="0x1" edc:name="RXBKIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FERIE" edc:desc="" edc:mask="0x1" edc:name="FERIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CERIE" edc:desc="" edc:mask="0x1" edc:name="CERIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ABDOVE" edc:desc="" edc:mask="0x1" edc:name="ABDOVE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PERIE" edc:desc="" edc:mask="0x1" edc:name="PERIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXMTIE" edc:desc="" edc:mask="0x1" edc:name="TXMTIE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U3TXCIE" edc:desc="" edc:mask="0x1" edc:name="U3TXCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3RXFOIE" edc:desc="" edc:mask="0x1" edc:name="U3RXFOIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3RXBKIE" edc:desc="" edc:mask="0x1" edc:name="U3RXBKIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3FERIE" edc:desc="" edc:mask="0x1" edc:name="U3FERIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3CERIE" edc:desc="" edc:mask="0x1" edc:name="U3CERIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3ABDOVE" edc:desc="" edc:mask="0x1" edc:name="U3ABDOVE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3PERIE" edc:desc="" edc:mask="0x1" edc:name="U3PERIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U3TXMTIE" edc:desc="" edc:mask="0x1" edc:name="U3TXMTIE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
