garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F16Q41.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SMT1PRU" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SMT1PRU" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0x30B">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SMT1PR" edc:desc="" edc:mask="0xff" edc:name="SMT1PR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SMT1PR16" edc:desc="" edc:mask="0x1" edc:name="SMT1PR16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR17" edc:desc="" edc:mask="0x1" edc:name="SMT1PR17" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR18" edc:desc="" edc:mask="0x1" edc:name="SMT1PR18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR19" edc:desc="" edc:mask="0x1" edc:name="SMT1PR19" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR20" edc:desc="" edc:mask="0x1" edc:name="SMT1PR20" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR21" edc:desc="" edc:mask="0x1" edc:name="SMT1PR21" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR22" edc:desc="" edc:mask="0x1" edc:name="SMT1PR22" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SMT1PR23" edc:desc="" edc:mask="0x1" edc:name="SMT1PR23" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-nnnnnn" edc:cname="SMT1CON0" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="SMT1CON0" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0x30C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SMT1PS" edc:desc="" edc:mask="0x3" edc:name="SMT1PS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CPOL" edc:desc="" edc:mask="0x1" edc:name="CPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPOL" edc:desc="" edc:mask="0x1" edc:name="SPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPOL" edc:desc="" edc:mask="0x1" edc:name="WPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STP" edc:desc="" edc:mask="0x1" edc:name="STP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SMT1PS0" edc:desc="" edc:mask="0x1" edc:name="SMT1PS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1PS1" edc:desc="" edc:mask="0x1" edc:name="SMT1PS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn--nnnn" edc:cname="SMT1CON1" edc:desc="" edc:impl="0xcf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000" edc:name="SMT1CON1" edc:nzwidth="8" edc:por="00--0000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0x30D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0xf" edc:name="MODE" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="REPEAT" edc:desc="" edc:mask="0x1" edc:name="REPEAT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1GO" edc:desc="" edc:mask="0x1" edc:name="SMT1GO" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE3" edc:desc="" edc:mask="0x1" edc:name="MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SMT1MODE" edc:desc="" edc:mask="0xf" edc:name="SMT1MODE" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SMT1REPEAT" edc:desc="" edc:mask="0x1" edc:name="SMT1REPEAT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SMT1MODE0" edc:desc="" edc:mask="0x1" edc:name="SMT1MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1MODE1" edc:desc="" edc:mask="0x1" edc:name="SMT1MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1MODE2" edc:desc="" edc:mask="0x1" edc:name="SMT1MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1MODE3" edc:desc="" edc:mask="0x1" edc:name="SMT1MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn--rrr" edc:cname="SMT1STAT" edc:desc="" edc:impl="0xe7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000--000" edc:name="SMT1STAT" edc:nzwidth="8" edc:por="000--000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0x30E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AS" edc:desc="" edc:mask="0x1" edc:name="AS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WS" edc:desc="" edc:mask="0x1" edc:name="WS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TS" edc:desc="" edc:mask="0x1" edc:name="TS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RST" edc:desc="" edc:mask="0x1" edc:name="RST" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPWUP" edc:desc="" edc:mask="0x1" edc:name="CPWUP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CPRUP" edc:desc="" edc:mask="0x1" edc:name="CPRUP" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SMT1AS" edc:desc="" edc:mask="0x1" edc:name="SMT1AS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1WS" edc:desc="" edc:mask="0x1" edc:name="SMT1WS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1TS" edc:desc="" edc:mask="0x1" edc:name="SMT1TS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SMT1RESET" edc:desc="" edc:mask="0x1" edc:name="SMT1RESET" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1CPWUP" edc:desc="" edc:mask="0x1" edc:name="SMT1CPWUP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1CPRUP" edc:desc="" edc:mask="0x1" edc:name="SMT1CPRUP" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="SMT1CLK" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="SMT1CLK" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0x30F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CSEL" edc:desc="" edc:mask="0xf" edc:name="CSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CSEL0" edc:desc="" edc:mask="0x1" edc:name="CSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSEL1" edc:desc="" edc:mask="0x1" edc:name="CSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSEL2" edc:desc="" edc:mask="0x1" edc:name="CSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSEL3" edc:mask="0x1" edc:name="CSEL3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SMT1CSEL" edc:desc="" edc:mask="0xf" edc:name="SMT1CSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SMT1CSEL0" edc:desc="" edc:mask="0x1" edc:name="SMT1CSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1CSEL1" edc:desc="" edc:mask="0x1" edc:name="SMT1CSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1CSEL2" edc:desc="" edc:mask="0x1" edc:name="SMT1CSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1CSEL3" edc:mask="0x1" edc:name="SMT1CSEL3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SMT1SIG" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="SMT1SIG" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0x310">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSEL" edc:desc="" edc:mask="0x1f" edc:name="SSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SSEL0" edc:desc="" edc:mask="0x1" edc:name="SSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSEL1" edc:desc="" edc:mask="0x1" edc:name="SSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSEL2" edc:desc="" edc:mask="0x1" edc:name="SSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSEL3" edc:mask="0x1" edc:name="SSEL3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSEL4" edc:mask="0x1" edc:name="SSEL4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SMT1SSEL" edc:desc="" edc:mask="0x1f" edc:name="SMT1SSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SMT1SSEL0" edc:desc="" edc:mask="0x1" edc:name="SMT1SSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1SSEL1" edc:desc="" edc:mask="0x1" edc:name="SMT1SSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1SSEL2" edc:desc="" edc:mask="0x1" edc:name="SMT1SSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1SSEL3" edc:mask="0x1" edc:name="SMT1SSEL3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMT1SSEL4" edc:mask="0x1" edc:name="SMT1SSEL4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SMT1WIN" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="SMT1WIN" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02594_tmr_smt_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0x311">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WSEL" edc:desc="" edc:mask="0x1f" edc:name="WSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="WSEL0" edc:desc="" edc:mask="0x1" edc:name="WSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WSEL1" edc:desc="" edc:mask="0x1" edc:name="WSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WSEL2" edc:desc="" edc:mask="0x1" edc:name="WSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WSEL3" edc:desc="" edc:mask="0x1" edc:name="WSEL3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WSEL4" edc:mask="0x1" edc:name="WSEL4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SMT1WSEL" edc:desc="" edc:mask="0x1f" edc:name="SMT1WSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SMT1WSEL0" edc:desc="" edc:mask="0x1" edc:name="SMT1WSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1WSEL1" edc:desc="" edc:mask="0x1" edc:name="SMT1WSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1WSEL2" edc:desc="" edc:mask="0x1" edc:name="SMT1WSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1WSEL3" edc:desc="" edc:mask="0x1" edc:name="SMT1WSEL3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1WSEL4" edc:mask="0x1" edc:name="SMT1WSEL4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="TMR1" edc:desc="Joined 16-bit Timer" edc:name="TMR1" edc:nzwidth="0x10" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x312"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR1L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x312">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1L" edc:mask="0xff" edc:name="TMR1L" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR1L0" edc:mask="0x1" edc:name="TMR1L0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L1" edc:mask="0x1" edc:name="TMR1L1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L2" edc:mask="0x1" edc:name="TMR1L2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L3" edc:mask="0x1" edc:name="TMR1L3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L4" edc:mask="0x1" edc:name="TMR1L4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L5" edc:mask="0x1" edc:name="TMR1L5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L6" edc:mask="0x1" edc:name="TMR1L6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L7" edc:mask="0x1" edc:name="TMR1L7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TMR10" edc:mask="0x1" edc:name="TMR10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR11" edc:mask="0x1" edc:name="TMR11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR12" edc:mask="0x1" edc:name="TMR12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR13" edc:mask="0x1" edc:name="TMR13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR14" edc:mask="0x1" edc:name="TMR14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR15" edc:mask="0x1" edc:name="TMR15" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR16" edc:mask="0x1" edc:name="TMR16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR17" edc:mask="0x1" edc:name="TMR17" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
