garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F16Q41.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCDATAH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCDATAH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04065_math_progcrc_v8.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x34F">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xff" edc:name="DATA" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DATA8" edc:mask="0x1" edc:name="DATA8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA9" edc:mask="0x1" edc:name="DATA9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA10" edc:mask="0x1" edc:name="DATA10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA11" edc:mask="0x1" edc:name="DATA11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA12" edc:mask="0x1" edc:name="DATA12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA13" edc:mask="0x1" edc:name="DATA13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA14" edc:mask="0x1" edc:name="DATA14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA15" edc:mask="0x1" edc:name="DATA15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCDATAU" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCDATAU" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04065_math_progcrc_v8.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x350">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xff" edc:name="DATA" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DATA16" edc:mask="0x1" edc:name="DATA16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA17" edc:mask="0x1" edc:name="DATA17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA18" edc:mask="0x1" edc:name="DATA18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA19" edc:mask="0x1" edc:name="DATA19" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA20" edc:mask="0x1" edc:name="DATA20" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA21" edc:mask="0x1" edc:name="DATA21" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA22" edc:mask="0x1" edc:name="DATA22" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA23" edc:mask="0x1" edc:name="DATA23" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCDATAT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCDATAT" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04065_math_progcrc_v8.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x351">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xff" edc:name="DATA" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DATA24" edc:mask="0x1" edc:name="DATA24" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA25" edc:mask="0x1" edc:name="DATA25" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA26" edc:mask="0x1" edc:name="DATA26" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA27" edc:mask="0x1" edc:name="DATA27" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA28" edc:mask="0x1" edc:name="DATA28" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA29" edc:mask="0x1" edc:name="DATA29" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA30" edc:mask="0x1" edc:name="DATA30" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA31" edc:mask="0x1" edc:name="DATA31" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="CRCOUT" edc:desc="" edc:name="CRCOUT" edc:nzwidth="0x10" edc:_modsrc="DOS-04065_math_progcrc_v8.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x352">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CRCSHFT"/>
            <edc:LegacyAlias edc:cname="CRCXOR"/>
          </edc:AliasList>
          <edc:SFRModeList/>
          <edc:MuxedSFRDef edc:nzwidth="0x8" edc:_addr="0x352">
            <edc:SelectSFR edc:when="($0xC &amp; 0x0C) == 0x00">
              <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCOUTL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCOUTL" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x352">
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="OUT" edc:mask="0xff" edc:name="OUT" edc:nzwidth="0x8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="OUT0" edc:mask="0x1" edc:name="OUT0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT1" edc:mask="0x1" edc:name="OUT1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT2" edc:mask="0x1" edc:name="OUT2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT3" edc:mask="0x1" edc:name="OUT3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT4" edc:mask="0x1" edc:name="OUT4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT5" edc:mask="0x1" edc:name="OUT5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT6" edc:mask="0x1" edc:name="OUT6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT7" edc:mask="0x1" edc:name="OUT7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
            <edc:SelectSFR edc:when="($0xC &amp; 0x0C) == 0x04">
              <edc:SFRDef edc:access="rrrrrrrr" edc:cname="CRCSHFTL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCSHFTL" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x352">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="CRCSHIFTL"/>
                </edc:AliasList>
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="SHIFT" edc:mask="0xff" edc:name="SHIFT" edc:nzwidth="0x8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="SHIFT0" edc:mask="0x1" edc:name="SHIFT0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT1" edc:mask="0x1" edc:name="SHIFT1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT2" edc:mask="0x1" edc:name="SHIFT2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT3" edc:mask="0x1" edc:name="SHIFT3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT4" edc:mask="0x1" edc:name="SHIFT4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT5" edc:mask="0x1" edc:name="SHIFT5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT6" edc:mask="0x1" edc:name="SHIFT6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT7" edc:mask="0x1" edc:name="SHIFT7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
            <edc:SelectSFR edc:when="($0xC &amp; 0x0C) == 0x08">
              <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCXORL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCXORL" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x352">
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="XOR" edc:mask="0xff" edc:name="XOR" edc:nzwidth="0x8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="XOR0" edc:mask="0x1" edc:name="XOR0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR1" edc:mask="0x1" edc:name="XOR1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR2" edc:mask="0x1" edc:name="XOR2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR3" edc:mask="0x1" edc:name="XOR3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR4" edc:mask="0x1" edc:name="XOR4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR5" edc:mask="0x1" edc:name="XOR5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR6" edc:mask="0x1" edc:name="XOR6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR7" edc:mask="0x1" edc:name="XOR7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
          </edc:MuxedSFRDef>
          <edc:MuxedSFRDef edc:nzwidth="0x8" edc:_addr="0x353">
            <edc:SelectSFR edc:when="($0xC &amp; 0x0C) == 0x00">
              <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCOUTH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCOUTH" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x353">
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="OUT" edc:mask="0xff" edc:name="OUT" edc:nzwidth="0x8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="OUT8" edc:mask="0x1" edc:name="OUT8" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT9" edc:mask="0x1" edc:name="OUT9" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT10" edc:mask="0x1" edc:name="OUT10" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT11" edc:mask="0x1" edc:name="OUT11" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT12" edc:mask="0x1" edc:name="OUT12" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT13" edc:mask="0x1" edc:name="OUT13" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT14" edc:mask="0x1" edc:name="OUT14" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT15" edc:mask="0x1" edc:name="OUT15" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
            <edc:SelectSFR edc:when="($0xC &amp; 0x0C) == 0x04">
              <edc:SFRDef edc:access="rrrrrrrr" edc:cname="CRCSHFTH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCSHFTH" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x353">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="CRCSHIFTH"/>
                </edc:AliasList>
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="SHIFT" edc:mask="0xff" edc:name="SHIFT" edc:nzwidth="0x8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="SHIFT8" edc:mask="0x1" edc:name="SHIFT8" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT9" edc:mask="0x1" edc:name="SHIFT9" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT10" edc:mask="0x1" edc:name="SHIFT10" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT11" edc:mask="0x1" edc:name="SHIFT11" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT12" edc:mask="0x1" edc:name="SHIFT12" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT13" edc:mask="0x1" edc:name="SHIFT13" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT14" edc:mask="0x1" edc:name="SHIFT14" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT15" edc:mask="0x1" edc:name="SHIFT15" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
            <edc:SelectSFR edc:when="($0xC &amp; 0x0C) == 0x08">
              <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCXORH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCXORH" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x353">
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="XOR" edc:mask="0xff" edc:name="XOR" edc:nzwidth="0x8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="XOR8" edc:mask="0x1" edc:name="XOR8" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR9" edc:mask="0x1" edc:name="XOR9" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR10" edc:mask="0x1" edc:name="XOR10" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR11" edc:mask="0x1" edc:name="XOR11" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR12" edc:mask="0x1" edc:name="XOR12" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR13" edc:mask="0x1" edc:name="XOR13" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR14" edc:mask="0x1" edc:name="XOR14" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR15" edc:mask="0x1" edc:name="XOR15" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
          </edc:MuxedSFRDef>
          <edc:MuxedSFRDef edc:nzwidth="0x8" edc:_addr="0x354">
            <edc:SelectSFR edc:when="($0xC &amp; 0x0C) == 0x00">
              <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCOUTU" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCOUTU" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x354">
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="OUT" edc:mask="0xff" edc:name="OUT" edc:nzwidth="0x8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="OUT16" edc:mask="0x1" edc:name="OUT16" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT17" edc:mask="0x1" edc:name="OUT17" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT18" edc:mask="0x1" edc:name="OUT18" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT19" edc:mask="0x1" edc:name="OUT19" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT20" edc:mask="0x1" edc:name="OUT20" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT21" edc:mask="0x1" edc:name="OUT21" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT22" edc:mask="0x1" edc:name="OUT22" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT23" edc:mask="0x1" edc:name="OUT23" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
            <edc:SelectSFR edc:when="($0xC &amp; 0x0C) == 0x04">
              <edc:SFRDef edc:access="rrrrrrrr" edc:cname="CRCSHFTU" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCSHFTU" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x354">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="CRCSHIFTU"/>
                </edc:AliasList>
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="SHIFT" edc:mask="0xff" edc:name="SHIFT" edc:nzwidth="0x8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="SHIFT16" edc:mask="0x1" edc:name="SHIFT16" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT17" edc:mask="0x1" edc:name="SHIFT17" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT18" edc:mask="0x1" edc:name="SHIFT18" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT19" edc:mask="0x1" edc:name="SHIFT19" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT20" edc:mask="0x1" edc:name="SHIFT20" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT21" edc:mask="0x1" edc:name="SHIFT21" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT22" edc:mask="0x1" edc:name="SHIFT22" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT23" edc:mask="0x1" edc:name="SHIFT23" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
            <edc:SelectSFR edc:when="($0xC &amp; 0x0C) == 0x08">
              <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCXORU" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCXORU" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x354">
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="XOR" edc:mask="0xff" edc:name="XOR" edc:nzwidth="0x8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="XOR16" edc:mask="0x1" edc:name="XOR16" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR17" edc:mask="0x1" edc:name="XOR17" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR18" edc:mask="0x1" edc:name="XOR18" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR19" edc:mask="0x1" edc:name="XOR19" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR20" edc:mask="0x1" edc:name="XOR20" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR21" edc:mask="0x1" edc:name="XOR21" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR22" edc:mask="0x1" edc:name="XOR22" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR23" edc:mask="0x1" edc:name="XOR23" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
          </edc:MuxedSFRDef>
          <edc:MuxedSFRDef edc:nzwidth="0x8" edc:_addr="0x355">
            <edc:SelectSFR edc:when="($0xC &amp; 0x0C) == 0x00">
              <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCOUTT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCOUTT" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x355">
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="OUT" edc:mask="0xff" edc:name="OUT" edc:nzwidth="0x8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="OUT24" edc:mask="0x1" edc:name="OUT24" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT25" edc:mask="0x1" edc:name="OUT25" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT26" edc:mask="0x1" edc:name="OUT26" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT27" edc:mask="0x1" edc:name="OUT27" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT28" edc:mask="0x1" edc:name="OUT28" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT29" edc:mask="0x1" edc:name="OUT29" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT30" edc:mask="0x1" edc:name="OUT30" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="OUT31" edc:mask="0x1" edc:name="OUT31" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
            <edc:SelectSFR edc:when="($0xC &amp; 0x0C) == 0x04">
              <edc:SFRDef edc:access="rrrrrrrr" edc:cname="CRCSHFTT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCSHFTT" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x355">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="CRCSHIFTT"/>
                </edc:AliasList>
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="SHIFT" edc:mask="0xff" edc:name="SHIFT" edc:nzwidth="0x8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="SHIFT24" edc:mask="0x1" edc:name="SHIFT24" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT25" edc:mask="0x1" edc:name="SHIFT25" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT26" edc:mask="0x1" edc:name="SHIFT26" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT27" edc:mask="0x1" edc:name="SHIFT27" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT28" edc:mask="0x1" edc:name="SHIFT28" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT29" edc:mask="0x1" edc:name="SHIFT29" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT30" edc:mask="0x1" edc:name="SHIFT30" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="SHIFT31" edc:mask="0x1" edc:name="SHIFT31" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
